Masmiseim36/nxpSDK/boards/hvpkv58f/project_template/pin_mux.h
/*
 * Copyright 2018-2019 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTD0 (number 127), MB_J11[A14]/MB_U12[18]/MB_PWM_AT/J4[A14]/PWM0
  @{ */
#define MB_PWM_AT_PORT PORTD /*!<@brief PORT device name: PORTD */
#define MB_PWM_AT_PIN 0U     /*!<@brief PORTD pin index: 0 */
                             /* @} */

/*! @name PORTD1 (number 128), MB_J11[A15]/MB_U12[12]/MB_PWM_AB/J4[A15]/PWM1
  @{ */
#define MB_PWM_AB_PORT PORTD /*!<@brief PORT device name: PORTD */
#define MB_PWM_AB_PIN 1U     /*!<@brief PORTD pin index: 1 */
                             /* @} */

/*! @name PORTD2 (number 129), MB_J11[A16]/MB_U12[19]/MB_PWM_BT/J4[A16]/PWM2
  @{ */
#define MB_PWM_BT_PORT PORTD /*!<@brief PORT device name: PORTD */
#define MB_PWM_BT_PIN 2U     /*!<@brief PORTD pin index: 2 */
                             /* @} */

/*! @name PORTD3 (number 130), MB_J11[A17]/MB_U12[13]/MB_PWM_BB/J4[A17]/PWM3
  @{ */
#define MB_PWM_BB_PORT PORTD /*!<@brief PORT device name: PORTD */
#define MB_PWM_BB_PIN 3U     /*!<@brief PORTD pin index: 3 */
                             /* @} */

/*! @name PORTD4 (number 131), MB_J11[A18]/MB_U12[20]/MB_PWM_CT/J4[A18]/PWM4
  @{ */
#define MB_PWM_CT_PORT PORTD /*!<@brief PORT device name: PORTD */
#define MB_PWM_CT_PIN 4U     /*!<@brief PORTD pin index: 4 */
                             /* @} */

/*! @name PORTD5 (number 132), MB_J11[A19]/MB_U12[14]/MB_PWM_CB/J4[A19]/PWM5
  @{ */
#define MB_PWM_CB_PORT PORTD /*!<@brief PORT device name: PORTD */
#define MB_PWM_CB_PIN 5U     /*!<@brief PORTD pin index: 5 */
                             /* @} */

/*! @name PORTE1 (number 2), MB_J11[A25]/MB_U12[11]/MB_TP28/MB_FAULT/MB_FAULT_1/MB_PFC_overcurrent/J4[A25]/FAULT_1
  @{ */
#define MB_FAULT_1_PORT PORTE /*!<@brief PORT device name: PORTE */
#define MB_FAULT_1_PIN 1U     /*!<@brief PORTE pin index: 1 */
                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitMC_PWMPins(void);

/*! @name PORTC6 (number 111), MB_J11[B21]/MB_PFC_zc_2/J4[B21]/MB_TP_27
  @{ */
#define MB_PFC_ZC_2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define MB_PFC_ZC_2_PIN 6U     /*!<@brief PORTC pin index: 6 */
                               /* @} */

/*! @name PORTC7 (number 112), MB_J11[B22]/MB_PFC_zc_1/J4[B22]/MB_TP_26
  @{ */
#define MB_PFC_ZC_1_PORT PORTC /*!<@brief PORT device name: PORTC */
#define MB_PFC_ZC_1_PIN 7U     /*!<@brief PORTC pin index: 7 */
                               /* @} */

/*! @name PORTC13 (number 118), MB_J11[B28]/MB_Q3[1]/MB_Relay/J4[B28]/Relay
  @{ */
#define MB_RELAY_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define MB_RELAY_PORT PORTC /*!<@brief PORT device name: PORTC */
#define MB_RELAY_PIN 13U    /*!<@brief PORTC pin index: 13 */
                            /* @} */

/*! @name PORTC1 (number 104), MB_J11[A22]/MB_U14[4]/MB_TP15/MB_PWM_PFC2/J4[A22]/PWM8
  @{ */
#define MB_PWM_PFC2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define MB_PWM_PFC2_PIN 1U     /*!<@brief PORTC pin index: 1 */
                               /* @} */

/*! @name PORTC2 (number 105), MB_J11[A23]/MB_U14[2]/MB_TP12/MB_PWM_PFC1/J4[A23]/PWM9
  @{ */
#define MB_PWM_PFC1_PORT PORTC /*!<@brief PORT device name: PORTC */
#define MB_PWM_PFC1_PIN 2U     /*!<@brief PORTC pin index: 2 */
                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitPFCPins(void);

/*! @name PORTE29 (number 37), MB_J11[B3]/MB_U8B[7]/MB_TP34/MB_I_sense_DCB/J4[B3]/I_dcb
  @{ */
#define MB_I_DCB_PORT PORTE /*!<@brief PORT device name: PORTE */
#define MB_I_DCB_PIN 29U    /*!<@brief PORTE pin index: 29 */
                            /* @} */

/*! @name PORTE17 (number 19), MB_J11[B4]/MB_TP31/MB_V_sense_DCB/MB_DCB_Pos/J4[B4]/U_dcb
  @{ */
#define MB_U_DCB_PORT PORTE /*!<@brief PORT device name: PORTE */
#define MB_U_DCB_PIN 17U    /*!<@brief PORTE pin index: 17 */
                            /* @} */

/*! @name PORTE18 (number 20), MB_J11[B5]/MB_TP33/'MB_V_sense_DCB/2'/J4[B5]/'U_dcb/2'
  @{ */
#define MB_U_DCB_HALF_PORT PORTE /*!<@brief PORT device name: PORTE */
#define MB_U_DCB_HALF_PIN 18U    /*!<@brief PORTE pin index: 18 */
                                 /* @} */

/*! @name PORTE19 (number 21), MB_J11[B9]/MB_U12[2]/MB_TP38/MB_IPM_temp/J4[B9]/Temp_IPM
  @{ */
#define MB_TEMP_IPM_PORT PORTE /*!<@brief PORT device name: PORTE */
#define MB_TEMP_IPM_PIN 19U    /*!<@brief PORTE pin index: 19 */
                               /* @} */

/*! @name HSADC0A_CH2 (number 27), MB_J11[A3]/MB_U11A[1]/MB_TP45/MB_I_sense_A/J4[A3]/I_phA
  @{ */
/* @} */

/*! @name HSADC0A_CH3 (number 28), MB_J11[A4]/MB_U11B[7]/MB_TP40/MB_I_sense_B/J4[A4]/I_phB
  @{ */
/* @} */

/*! @name HSADC0A_CH10 (number 29), MB_J11[A5]/MB_U8A[1]/MB_TP37/MB_I_sense_C/J4[A5]/I_phC
  @{ */
/* @} */

/*! @name PORTE30 (number 38), MB_J11[A6]/MB_TP16/MB_TACHO/J4[A6]/TACHO
  @{ */
#define MB_TACHO_PORT PORTE /*!<@brief PORT device name: PORTE */
#define MB_TACHO_PIN 30U    /*!<@brief PORTE pin index: 30 */
                            /* @} */

/*! @name HSADC0A_CH11 (number 30), MB_J11[A7]/MB_TP18/MB_Vin/J4[A7]/V_in
  @{ */
/* @} */

/*! @name PORTC8 (number 113), MB_J11[A8]/MB_U2B[7]/MB_TP14/MB_Ipfc1/J4[A8]/I_pfc1
  @{ */
#define MB_I_PFC1_PORT PORTC /*!<@brief PORT device name: PORTC */
#define MB_I_PFC1_PIN 8U     /*!<@brief PORTC pin index: 8 */
                             /* @} */

/*! @name PORTC9 (number 114), MB_J11[A9]/MB_U2A[1]/MB_TP5/MB_Ipfc2/J4[A9]/I_pfc2
  @{ */
#define MB_I_PFC2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define MB_I_PFC2_PIN 9U     /*!<@brief PORTC pin index: 9 */
                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitANA_SENSPins(void);

/*! @name PORTE3 (number 4), MB_J11[B6]/MB_TP44/MB_BEMF_sense_A/MB_Phase_A/J4[B6]/BEMF_A
  @{ */
#define MB_BEMF_A_PORT PORTE /*!<@brief PORT device name: PORTE */
#define MB_BEMF_A_PIN 3U     /*!<@brief PORTE pin index: 3 */
                             /* @} */

/*! @name CMP0_IN4 (number 39), MB_J11[B6]/MB_TP44/MB_BEMF_sense_A/MB_Phase_A/J4[B6]/BEMF_A
  @{ */
/* @} */

/*! @name PORTA1 (number 51), U1A[99]/cpm0_out
  @{ */
#define MB_BEMF_A_CMP_OUT_PORT PORTA /*!<@brief PORT device name: PORTA */
#define MB_BEMF_A_CMP_OUT_PIN 1U     /*!<@brief PORTA pin index: 1 */
                                     /* @} */

