Masmiseim36/nxpSDK/boards/hvpkv58f/project_template/pin_mux.h
/*! @name PORTB20 (number 99), U1B[51]/cmp0_out
  @{ */
#define MB_BEMF_A_CAPTURE_PORT PORTB /*!<@brief PORT device name: PORTB */
#define MB_BEMF_A_CAPTURE_PIN 20U    /*!<@brief PORTB pin index: 20 */
                                     /* @} */

/*! @name PORTE24 (number 45), MB_J11[B7]/MB_TP43/MB_BEMF_sense_B/MB_Phase_B/U1A[64]/J4[B7]/BEMF_B
  @{ */
#define MB_BEMF_B_PORT PORTE /*!<@brief PORT device name: PORTE */
#define MB_BEMF_B_PIN 24U    /*!<@brief PORTE pin index: 24 */
                             /* @} */

/*! @name PORTA12 (number 64), MB_J11[B7]/MB_TP43/MB_BEMF_sense_B/MB_Phase_B/U1B[45]/J4[B7]/BEMF_B
  @{ */
#define MB_BEMF_B_CMP_IN_PORT PORTA /*!<@brief PORT device name: PORTA */
#define MB_BEMF_B_CMP_IN_PIN 12U    /*!<@brief PORTA pin index: 12 */
                                    /* @} */

/*! @name PORTA5 (number 55), U1A[100]/cmp2_out
  @{ */
#define MB_BEMF_B_CMP_OUT_PORT PORTA /*!<@brief PORT device name: PORTA */
#define MB_BEMF_B_CMP_OUT_PIN 5U     /*!<@brief PORTA pin index: 5 */
                                     /* @} */

/*! @name PORTB21 (number 100), U1B[55]/cmp2_out
  @{ */
#define MB_BEMF_B_CAPTURE_PORT PORTB /*!<@brief PORT device name: PORTB */
#define MB_BEMF_B_CAPTURE_PIN 21U    /*!<@brief PORTB pin index: 21 */
                                     /* @} */

/*! @name PORTE25 (number 46), MB_J11[B8]/MB_TP41/MB_BEMF_sense_C/MB_Phase_C/U1A[66]/J4[B8]/BEMF_C
  @{ */
#define MB_BEMF_C_PORT PORTE /*!<@brief PORT device name: PORTE */
#define MB_BEMF_C_PIN 25U    /*!<@brief PORTE pin index: 25 */
                             /* @} */

/*! @name PORTA14 (number 66), MB_J11[B8]/MB_TP41/MB_BEMF_sense_C/MB_Phase_C/U1B[46]/J4[B8]/BEMF_C
  @{ */
#define MB_BEMF_C_CMP_IN_PORT PORTA /*!<@brief PORT device name: PORTA */
#define MB_BEMF_C_CMP_IN_PIN 14U    /*!<@brief PORTA pin index: 14 */
                                    /* @} */

/*! @name PORTB23 (number 102), U1A[101]/cmp3_out
  @{ */
#define MB_BEMF_C_CMP_OUT_PORT PORTB /*!<@brief PORT device name: PORTB */
#define MB_BEMF_C_CMP_OUT_PIN 23U    /*!<@brief PORTB pin index: 23 */
                                     /* @} */

/*! @name PORTB22 (number 101), U1A[102]/cmp3_out
  @{ */
#define MB_BEMF_C_CAPTURE_PORT PORTB /*!<@brief PORT device name: PORTB */
#define MB_BEMF_C_CAPTURE_PIN 22U    /*!<@brief PORTB pin index: 22 */
                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitBEMFPins(void);

/*! @name PORTB16 (number 95), MB_J9[3]/MB_J11[B14]/MB_TP13/MB_ENC_PhaseA/J4[B14]/TM0
  @{ */
#define MB_ENC_PHASE_A_PORT PORTB /*!<@brief PORT device name: PORTB */
#define MB_ENC_PHASE_A_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                  /* @} */

/*! @name PORTC5 (number 110), MB_J9[4]/MB_J11[B15]/MB_TP17/MB_ENC_PhaseB/J4[B15]/TM1
  @{ */
#define MB_ENC_PHASE_B_PORT PORTC /*!<@brief PORT device name: PORTC */
#define MB_ENC_PHASE_B_PIN 5U     /*!<@brief PORTC pin index: 5 */
                                  /* @} */

/*! @name PORTE0 (number 1), MB_J9[5]/MB_J11[B16]/MB_TP19/MB_ENC_Index/J4[B16]/TM2
  @{ */
#define MB_ENC_INDEX_PORT PORTE /*!<@brief PORT device name: PORTE */
#define MB_ENC_INDEX_PIN 0U     /*!<@brief PORTE pin index: 0 */
                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitENCPins(void);

#define SOPT5_UART0RXSRC_UART_RX 0x00u /*!<@brief UART 0 receive data source select: UART0_RX pin */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTD7 (number 136), MB_J1[3]/MB_J11[B26]/MB_U1[13]/MB_U3[25]/MB_TP3/MB_TP7/MB_TxD/J4[B26]/TxD
  @{ */
#define MB_TXD_PORT PORTD /*!<@brief PORT device name: PORTD */
#define MB_TXD_PIN 7U     /*!<@brief PORTD pin index: 7 */
                          /* @} */

/*! @name PORTD6 (number 133), MB_J3[2]/MB_J11[B27]/MB_U1[12]/MB_U3[26]/MB_TP2/MB_TP10/MB_RxD/J4[B27]/RxD
  @{ */
#define MB_RXD_PORT PORTD /*!<@brief PORT device name: PORTD */
#define MB_RXD_PIN 6U     /*!<@brief PORTD pin index: 6 */
                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitUSB_UARTPins(void);

/*! @name PORTC16 (number 123), MB_J11[B25]/MB_U9[2]/MB_TP_35/MB_MCU_BRAKE/J4[B25]/MCU_BRAKE
  @{ */
#define MB_MCU_BRAKE_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define MB_MCU_BRAKE_PORT PORTC /*!<@brief PORT device name: PORTC */
#define MB_MCU_BRAKE_PIN 16U    /*!<@brief PORTC pin index: 16 */
                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitBRAKEPins(void);

#define SOPT5_UART0RXSRC_UART_RX 0x00u /*!<@brief UART 0 receive data source select: UART0_RX pin */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTE20 (number 25), MB_J1[1]/MB_J2[3]/MB_J11[A31]/MB_TxD_1/MB_TxD_EXT/J4[A31]/TxD1
  @{ */
#define MB_TXD_1_PORT PORTE /*!<@brief PORT device name: PORTE */
#define MB_TXD_1_PIN 20U    /*!<@brief PORTE pin index: 20 */
                            /* @} */

/*! @name PORTE21 (number 26), MB_J2[4]/MB_J3[4]/MB_J11[A32]/MB_RxD_1/MB_RxD_EXT/J4[A32]/RxD1
  @{ */
#define MB_RXD_1_PORT PORTE /*!<@brief PORT device name: PORTE */
#define MB_RXD_1_PIN 21U    /*!<@brief PORTE pin index: 21 */
                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitEXT_UARTPins(void);

#define SOPT7_HSADC0AALTTRGEN_XBAR 0x00u /*!<@brief HSADC0A alternate trigger enable: XBARA output 12. */
#define SOPT7_HSADC1ATRGSEL_XBAR 0x0Cu   /*!<@brief HSADC1A trigger select: XBARA output 41 */

/*! @name PORTA13 (number 65), MB_J11[A26]/MB_U9[2]/MB_TP35/MB_FAULT_2/MB_Over-voltage_FAULT/J4[A26]/FAULT_2
  @{ */
#define MB_FAULT_2_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define MB_FAULT_2_PORT PORTA /*!<@brief PORT device name: PORTA */
#define MB_FAULT_2_PIN 13U    /*!<@brief PORTA pin index: 13 */
                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitMISCPins(void);

/*! @name PORTA2 (number 52), U5[12]/J3[6]/SWO/SWO_ISOLATED
  @{ */
#define BOARD_SWO_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SWO_PIN 2U     /*!<@brief PORTA pin index: 2 */
                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

