Masmiseim36/nxpSDK/boards/hvpkv58f/project_template/pin_mux.h
/*! @name PORTA18 (number 72), Y2[1]/GPIOA18/EXTAL_J
  @{ */
#define BOARD_EXTAL0_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_EXTAL0_PIN 18U    /*!<@brief PORTA pin index: 18 */
                                /* @} */

/*! @name PORTA19 (number 73), Y2[3]/GPIOA19/XTAL_J
  @{ */
#define BOARD_XTAL0_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_XTAL0_PIN 19U    /*!<@brief PORTA pin index: 19 */
                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCPins(void);

#define SOPT5_UART1RXSRC_UART_RX 0x00u /*!<@brief UART 1 receive data source select: UART1_RX pin */
#define SOPT5_UART1TXSRC_UART_TX 0x00u /*!<@brief UART 1 transmit data source select: UART1_TX pin */

/*! @name PORTC3 (number 106), U2[25]/U8[12]/RxD_sda/UART_RX_TGTMCU
  @{ */
#define BOARD_UART_RX_TGTMCU_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_UART_RX_TGTMCU_PIN 3U     /*!<@brief PORTC pin index: 3 */
                                        /* @} */

/*! @name PORTC4 (number 109), U2[24]/U8[13]/TxD_sda/UART_TX_TGTMCU
  @{ */
#define BOARD_UART_TX_TGTMCU_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_UART_TX_TGTMCU_PIN 4U     /*!<@brief PORTC pin index: 4 */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*! @name PORTB4 (number 85), USER_LED_2
  @{ */
#define BOARD_LED_RED_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_LED_RED_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_LED_RED_PIN 4U     /*!<@brief PORTB pin index: 4 */
                                 /* @} */

/*! @name PORTB19 (number 98), MB_J11[B20]/MB_U9[4]/MB_USER_LED/J4[B20]/USER_LED
  @{ */
#define BOARD_LED_GREEN_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_LED_GREEN_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_LED_GREEN_PIN 19U    /*!<@brief PORTB pin index: 19 */
                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDSPins(void);

/*! @name PORTE5 (number 8), J9[15]/M2_PWM0
  @{ */
#define BOARD_M2_PWM0_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_M2_PWM0_PIN 5U     /*!<@brief PORTE pin index: 5 */
                                 /* @} */

/*! @name PORTE6 (number 9), J9[17]/M2_PWM1
  @{ */
#define BOARD_M2_PWM1_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_M2_PWM1_PIN 6U     /*!<@brief PORTE pin index: 6 */
                                 /* @} */

/*! @name PORTE7 (number 10), J9[19]/M2_PWM2
  @{ */
#define BOARD_M2_PWM2_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_M2_PWM2_PIN 7U     /*!<@brief PORTE pin index: 7 */
                                 /* @} */

/*! @name PORTE8 (number 11), J9[16]/M2_PWM3
  @{ */
#define BOARD_M2_PWM3_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_M2_PWM3_PIN 8U     /*!<@brief PORTE pin index: 8 */
                                 /* @} */

/*! @name PORTE9 (number 12), J9[18]/M2_PWM4
  @{ */
#define BOARD_M2_PWM4_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_M2_PWM4_PIN 9U     /*!<@brief PORTE pin index: 9 */
                                 /* @} */

/*! @name PORTE10 (number 13), J9[20]/M2_PWM5
  @{ */
#define BOARD_M2_PWM5_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_M2_PWM5_PIN 10U    /*!<@brief PORTE pin index: 10 */
                                 /* @} */

/*! @name PORTE22 (number 41), J9[13]/M2_FAULT1
  @{ */
#define BOARD_M2_FAULT1_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_M2_FAULT1_PIN 22U    /*!<@brief PORTE pin index: 22 */
                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitM2_MC_PWMPins(void);

/*! @name PORTE4 (number 7), J9[1]/M2_I_phA/CON1 - M2_I_phA
  @{ */
#define BOARD_M2_I_PH_A_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_M2_I_PH_A_PIN 4U     /*!<@brief PORTE pin index: 4 */
                                   /* @} */

/*! @name PORTB6 (number 87), J9[3]/CON3 - M2_I_phB
  @{ */
#define BOARD_M2_I_PH_B_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_M2_I_PH_B_PIN 6U     /*!<@brief PORTB pin index: 6 */
                                   /* @} */

/*! @name PORTB7 (number 88), J9[5]/CON5 - M2_I_phC
  @{ */
#define BOARD_M2_I_PH_C_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_M2_I_PH_C_PIN 7U     /*!<@brief PORTB pin index: 7 */
                                   /* @} */

/*! @name PORTB0 (number 81), J9[2]/M2_BEMF_A/CON2 - M2_BEMF_A
  @{ */
#define BOARD_M2_BEMF_A_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_M2_BEMF_A_PIN 0U     /*!<@brief PORTB pin index: 0 */
                                   /* @} */

/*! @name PORTB1 (number 82), J9[4]/M2_BEMF_B/CON4 - M2_BEMF_B
  @{ */
#define BOARD_M2_BEMF_B_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_M2_BEMF_B_PIN 1U     /*!<@brief PORTB pin index: 1 */
                                   /* @} */

/*! @name PORTB3 (number 84), J9[6]/M2_BEMF_C/CON6 - M2_BEMF_C
  @{ */
#define BOARD_M2_BEMF_C_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_M2_BEMF_C_PIN 3U     /*!<@brief PORTB pin index: 3 */
                                   /* @} */

/*! @name PORTB2 (number 83), J9[8]/M2_I_dcb/CON8 - M2_I_dcb
  @{ */
#define BOARD_M2_I_DCB_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_M2_I_DCB_PIN 2U     /*!<@brief PORTB pin index: 2 */
                                  /* @} */

/*! @name HSADC0A_CH7 (number 24), J9[7]/M2_U_dcb/CON7 - M2_U_dcb
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitM2_ANA_SENSEPins(void);

/*! @name PORTD14 (number 143), J9[14]/M2_GPIO
  @{ */
#define BOARD_M2_GPIO_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_M2_GPIO_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_M2_GPIO_PIN 14U    /*!<@brief PORTD pin index: 14 */
                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitM2_MISCPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
